import React from 'react';

const LessonBeforeAll = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Введение: начало
                </h1>
                <p className='headshadowtext'>
                    Прежде, чем начинать, прочтите это наставление...
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Web-разработка – это комплекс процессов, связанных с созданием веб-сайтов и приложений. Эта область находится в стадии активного развития, и всё больше людей стремятся изучить её. Если вы тоже хотите начать свой путь в web-разработке, то прежде всего нужно разобраться в некоторых базовых вещах.<br/>
                <br/>
                Определите цель. Прежде чем начинать изучать web-разработку, определитесь, что вы хотите создавать. Это может быть веб-сайт, онлайн-магазин, блог или что-то другое. Важно понимать, какую функциональность вы хотите реализовать и какой тип сайта вам нужен.<br/>
                <br/>
                Изучите HTML и CSS. HTML является основным языком разметки веб-страниц, а CSS позволяет задавать стили и оформление страницы. Без этих языков невозможно создать красивый и функциональный сайт.<br/>
                <br/>
                Узнайте основы программирования. Чтобы создавать динамические веб-страницы, нужно изучить языки программирования, такие как JavaScript, PHP, Python и другие. Не обязательно изучать все сразу, начните с одного языка и углубляйтесь в него по мере необходимости.<br/>
                <br/>
                Изучите фреймворки и библиотеки. Фреймворки и библиотеки помогают ускорить и упростить разработку веб-приложений. Некоторые из самых популярных фреймворков – это React, Angular и Vue.js.<br/>
                <br/>
                Изучите базы данных. Базы данных используются для хранения информации на веб-сайте. Наиболее распространенные базы данных – это MySQL, PostgreSQL, MongoDB и другие.<br/>
                <br/>
                Практикуйтесь. Не стоит останавливаться только на теории. Чтобы научиться создавать веб-сайты и приложения, нужно много практиковаться. Создавайте свои проекты и участвуйте в open-source проектах.<br/>
                <br/>
                Изучение web-разработки – это долгий и трудный путь, но если вы будете стараться и упорно работать, то сможете достичь успеха в этой области. Не бойтесь задавать вопросы и обращаться за помощью к другим разработчикам, это поможет вам развиваться и изучать новые технологии.<br/>
            </p>
        </div>
    );
}
const LessonRoadmaps = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Роудмапы
                </h1>
                <p className='headshadowtext'>
                    Роудмапы - это "карты навигации" по изучению и ориентировке в том, чтобы стать программистом
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Для начинающих web-разработчиков существует множество роадмапов, которые помогут им ориентироваться в этой области и развиваться. Вот некоторые из них:<br/>
                <br/>
                Роадмап для фронтенд-разработчика. Он включает в себя изучение HTML, CSS, JavaScript, фреймворков и библиотек, таких как React, Angular, Vue.js и других. Также необходимо изучить основы дизайна и пользовательского интерфейса. Сайты, которые могут помочь в изучении фронтенда: Codecademy, FreeCodeCamp, Udacity.<br/>
<br/>
                Роадмап для бэкенд-разработчика. Он включает изучение языков программирования, таких как Python, PHP, Ruby, Node.js, а также баз данных, таких как MySQL, PostgreSQL, MongoDB и других. Сайты, которые могут помочь в изучении бэкенда: Udemy, Coursera, Codecademy.<br/>
<br/>
                Роадмап для Full-Stack разработчика. Он включает в себя изучение как фронтенда, так и бэкенда, а также их интеграцию. Для этого нужно изучить языки программирования, фреймворки и библиотеки как для фронтенда, так и для бэкенда. Сайты, которые могут помочь в изучении Full-Stack разработки: Udemy, Coursera, FreeCodeCamp.<br/>
<br/>
                Роадмап для UI/UX-дизайнера. Он включает в себя изучение дизайна пользовательского интерфейса и пользовательского опыта. Необходимо изучить техники дизайна, использование инструментов для создания прототипов и тестирования пользовательского опыта. Сайты, которые могут помочь в изучении UI/UX-дизайна: InVision, Sketch, Figma.<br/>
<br/>
                Кроме того, есть множество онлайн-курсов, ресурсов и форумов, которые могут помочь начинающим web-разработчикам в изучении этой области. Некоторые из них:<br/>
<br/>
                Codecademy (https://www.codecademy.com/)<br/>
                FreeCodeCamp (https://www.freecodecamp.org/)<br/>
                Udemy (https://www.udemy.com/)<br/>
                Coursera (https://www.coursera.org/)<br/>
                MDN Web Docs (https://developer.mozilla.org/)<br/>
                Stack Overflow (https://stackoverflow.com/)<br/>
                Reddit r/webdev (https://www.reddit.com/r/webdev/)<br/>
            </p>
        </div>
    );
};
const LessonLangChoice = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Выбор ЯП
                </h1>
                <p className='headshadowtext'>
                    *ЯП - язык программирования
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Существует множество языков программирования, которые используются в web-разработке, и выбор языка зависит от целей и задач проекта. Вот некоторые из самых распространенных языков программирования и их применение в web-разработке:<br/>
<br/>
                HTML (Hypertext Markup Language) - это основной язык разметки для создания веб-страниц и веб-приложений. HTML позволяет разработчикам создавать структуру веб-страниц, добавлять текст, изображения, видео и другие элементы.<br/>
<br/>
                CSS (Cascading Style Sheets) - это язык, который используется для оформления веб-страниц и задания стилей элементам HTML. CSS позволяет управлять цветами, шрифтами, расположением элементов и другими аспектами дизайна веб-страниц.<br/>
<br/>
                JavaScript - это язык программирования, который используется для создания интерактивных веб-страниц и приложений. JavaScript позволяет добавлять анимацию, формы, проверку данных и другие функциональные элементы на веб-страницы.<br/>
<br/>
                PHP (Hypertext Preprocessor) - это серверный язык программирования, который используется для создания динамических веб-страниц и веб-приложений. PHP позволяет получать данные из базы данных, обрабатывать формы и другие данные, а также управлять сессиями и другими серверными аспектами.<br/>
<br/>
                Python - это язык программирования, который используется для создания веб-приложений, анализа данных и других задач. Python позволяет разработчикам создавать веб-серверы, работать с базами данных и использовать множество библиотек и фреймворков.<br/>
<br/>
                Ruby - это язык программирования, который используется для создания веб-приложений, а также для анализа данных и автоматизации задач. Ruby используется в основном с фреймворком Ruby on Rails, который упрощает процесс создания веб-приложений.<br/>
<br/>
                Выбор языка программирования зависит от потребностей проекта и уровня опыта разработчика. Для начинающих web-разработчиков обычно рекомендуется начинать с изучения HTML, CSS и JavaScript, а затем продолжить изучение других языков программирования, в зависимости от целей проекта.<br/>
            </p>
        </div>
    );
}
const LessonOnlineSch = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Онлайн школы
                </h1>
                <p className='headshadowtext'>
                    Что такое и с чем едят
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Онлайн-школы для начинающих веб-программистов - это образовательные платформы, которые предоставляют структурированный курс обучения основам веб-разработки.<br/>
<br/>
                Такие курсы могут помочь начинающим разработчикам освоить необходимые навыки и научиться создавать веб-сайты и приложения. Обучение в онлайн-школах может включать в себя изучение языков программирования (например, HTML, CSS, JavaScript, PHP, Python), фреймворков, средств разработки, работы с базами данных, создание веб-дизайна и т.д.<br/>
<br/>
                Онлайн-школы помогают начинающим веб-программистам ускорить свой процесс обучения, избежать ошибок, получить обратную связь от опытных преподавателей и работать над реальными проектами.<br/>
<br/>
                По завершении курса в онлайн-школе, студенты могут получить сертификат о прохождении, который может быть использован при поиске работы или продвижении в карьере веб-разработчика.<br/>
<br/>
                Но важно понимать, что курсы онлайн-школ не заменяют самостоятельное обучение и практику. Они лишь помогают начинающим веб-программистам получить хороший старт и основу для дальнейшего развития своих навыков веб-разработки.<br/>
            </p>
        </div>
    );
};
const LessonTutors = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Туторы
                </h1>
                <p className='headshadowtext'>
                    Почти самостоятельное обучение
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Люди, которые помогают начинающим веб-программистам начать свой путь, могут быть профессиональными веб-разработчиками или специалистами в области обучения и менторства. Они могут предлагать свои услуги как личные консультации, онлайн-курсы, вебинары и т.д.<br/>
<br/>
                Такие люди помогают новичкам понять основы веб-разработки, научиться создавать веб-сайты и приложения, избегать ошибок и быстрее достичь своих целей. Они могут также делиться своим опытом и советами, а также помогать своим ученикам решать проблемы и развивать свои навыки.<br/>
<br/>
                Кроме того, начинающие веб-программисты могут находить в таких людях не только менторов и учителей, но и возможных работодателей или своих будущих коллег в веб-разработке.<br/>
<br/>
                По окончании таких программ обучения и консультаций, ученики могут получить подтверждение своих знаний и сертификаты, которые могут быть использованы при поиске работы в веб-разработке или продвижении в своей карьере. Кроме того, такие ученики могут продолжать общаться и сотрудничать со своими менторами и учителями в будущем, получая новые знания и возможности для развития своих навыков веб-разработки.<br/>
            </p>
        </div>
    );
}
const LessonSelfLearn = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
Самообразование
                </h1>
                <p className='headshadowtext'>
самая тяжёлая часть...
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Самообучение - это процесс, при котором начинающие веб-программисты могут изучать веб-разработку на своем собственном темпе и свободном графике, используя онлайн-курсы, учебники, видеоуроки и другие доступные ресурсы.<br/>
<br/>
                Оно может быть полезным для тех, кто не может позволить себе посещение платных курсов или учебных заведений, но также может помочь учащимся сэкономить время и быстрее достичь своих целей.<br/>
<br/>
                Самообучение позволяет начинающим веб-программистам изучать те технологии и языки программирования, которые им интересны и необходимы для работы над конкретными проектами. Кроме того, оно дает возможность начинающим веб-программистам развивать свои навыки и экспертизу в конкретных областях веб-разработки.<br/>
<br/>
                При самообучении начинающие веб-программисты могут создавать свои собственные проекты и практиковаться в решении конкретных задач, что помогает им быстрее освоить технологии веб-разработки и подготовиться к работе в этой области.<br/>
<br/>
                По окончании самообучения начинающие веб-программисты могут создавать портфолио своих проектов и демонстрировать свои навыки и экспертизу потенциальным работодателям. Они также могут принимать участие в онлайн-конкурсах и проектах, чтобы продемонстрировать свои знания и навыки в веб-разработке.<br/>
            </p>
        </div>
    );
};
const LessonSkillbox = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
Онлайн-школа: Skillbox
                </h1>
                <p className='headshadowtext'>

                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                "Skillbox" - это онлайн-школа, которая предлагает курсы по веб-разработке для начинающих программистов.<br/>

                Школа предоставляет широкий спектр курсов, которые покрывают различные области веб-разработки, такие как HTML, CSS, JavaScript, PHP и другие. Курсы разработаны опытными специалистами и обеспечивают качественное обучение, которое позволяет начинающим веб-программистам получить необходимые навыки для работы в этой области.<br/>
                <br/>
                "Skillbox" предлагает не только теоретические знания, но и практические упражнения и проекты, которые помогают начинающим веб-программистам получить опыт и научиться применять свои знания на практике.<br/>
                <br/>
                По окончании курсов "Skillbox" начинающие веб-программисты могут получить сертификат, который подтверждает их знания и навыки в веб-разработке. Этот сертификат может быть полезен при поиске работы в этой области.<br/>
                <br/>
                Кроме того, "Skillbox" предлагает возможность участия в конкурсах и проектах, что помогает начинающим веб-программистам получить опыт работы в реальных проектах и научиться работать в команде.<br/>
                <br/>
                В целом, "Skillbox" - это отличный выбор для тех, кто хочет начать свой путь в веб-разработке и получить качественное обучение от опытных специалистов.<br/>
            </p>
        </div>
    );
}
const LessonSkillfactory = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Онлайн-школа: SkillFactory
                </h1>
                <p className='headshadowtext'>

                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Онлайн-школа "Skillfactory" является образовательным проектом для начинающих веб-программистов, которые хотят освоить основы программирования и получить необходимые знания и навыки для работы в этой области.<br/>
<br/>
                Школа предлагает курсы по различным темам, связанным с веб-разработкой, таким как HTML, CSS, JavaScript, PHP и другие. Курсы разработаны таким образом, чтобы помочь студентам освоить теорию и практические навыки программирования, используя современные инструменты и технологии.<br/>
<br/>
                В рамках курсов студенты получают доступ к различным материалам, включая видеоуроки, тесты, практические задания и проекты. Они также могут общаться с опытными преподавателями и другими студентами через специальные онлайн-форумы и чаты.<br/>
<br/>
                Завершив курсы в "Skillfactory", студенты получат сертификат об окончании, который подтверждает их знания и навыки в области веб-разработки. Это может быть полезным при поиске работы или продолжении обучения в других образовательных учреждениях.<br/>
<br/>
                В целом, онлайн-школа "Skillfactory" может быть полезным выбором для тех, кто хочет начать карьеру в веб-разработке и нуждается в основах программирования и веб-технологий.<br/>
            </p>
        </div>
    );
};
const LessonYaPractice = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Онлайн-курсы: Яндекс Практикум
                </h1>
                <p className='headshadowtext'>

                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Яндекс Практикум предлагает онлайн курсы для начинающих веб-программистов, которые помогут им изучить основы разработки веб-сайтов и приложений.

                Курсы Яндекс Практикума обычно содержат обширный учебный материал, практические задания и проекты, которые помогают студентам научиться программировать на реальных примерах. Курсы могут включать в себя такие темы, как HTML и CSS, JavaScript, фреймворки и библиотеки для разработки веб-приложений и многие другие.<br/>
<br/>
                Программа курса разбита на модули и уроки, которые позволяют студентам изучать материал по шагам и прогрессировать в своих знаниях. Также студенты могут общаться с опытными наставниками и преподавателями, которые помогут им разобраться в сложных вопросах и задачах.<br/>
<br/>
                После окончания курсов студенты получают сертификат Яндекс Практикума, который подтверждает их знания и может быть использован при поиске работы в сфере веб-разработки. Кроме того, студенты получают опыт работы над реальными проектами, что может быть очень полезным при поиске работы и развитии своей карьеры.<br/>
            </p>
        </div>
    );
}
const LessonGeekbrains = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Онлайн-школа: GeekBrains
                </h1>
                <p className='headshadowtext'>

                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Онлайн-школа "GeekBrains" предназначена для начинающих веб-программистов, которые хотят освоить профессию с нуля или улучшить свои знания и навыки в данной области.<br/>
<br/>
                Школа предлагает разнообразные курсы по программированию, веб-разработке и дизайну, такие как "Основы HTML и CSS", "JavaScript", "Python", "React", "Vue.js" и многие другие.<br/>
<br/>
                Студенты могут выбирать курсы, которые соответствуют их потребностям и уровню знаний, и учиться в удобное для них время и темпе. Курсы разработаны профессиональными преподавателями и предоставляются в формате видеоуроков, онлайн-занятий и практических заданий.<br/>
<br/>
                Обучение в школе помогает студентам приобрести необходимые навыки и знания в области веб-разработки и программирования, что может привести к получению новой работы или повышению квалификации в текущей компании.<br/>
<br/>
                После успешного окончания курсов студенты получают сертификаты о прохождении обучения, которые могут быть использованы при поиске работы.<br/>
<br/>
                Кроме того, школа предоставляет возможность для студентов общаться с преподавателями и другими студентами в онлайн-чате, что помогает получить дополнительные знания и улучшить практические навыки в области программирования и веб-разработки.<br/>
            </p>
        </div>
    );
};
const LessonYT = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
Самообразование: YouTube
                </h1>
                <p className='headshadowtext'>
с котятами
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Ютуб может быть очень полезным инструментом для самообучения начинающих веб-программистов. На платформе можно найти множество бесплатных уроков и обучающих видео, которые помогут изучить различные языки программирования, фреймворки и инструменты для разработки веб-сайтов и приложений.<br/>
<br/>
                Большинство видео на ютубе созданы опытными веб-разработчиками, которые делятся своим опытом и знаниями с начинающими. Эти видео могут помочь студентам изучать материал в своем собственном темпе и по мере своих возможностей.<br/>
<br/>
                С помощью видео на ютубе начинающие веб-программисты могут изучать различные аспекты веб-разработки, включая HTML, CSS, JavaScript, различные фреймворки и библиотеки, а также многие другие темы. Они также могут узнать о лучших практиках и методах разработки, что поможет им создавать более эффективные и профессиональные веб-сайты и приложения.<br/>
<br/>
                После просмотра видео на ютубе начинающие веб-программисты могут продолжать практиковать свои навыки, создавая свои собственные проекты и выполняя задания. Это поможет им закрепить полученные знания и улучшить свои навыки веб-разработки.<br/>
            </p>
        </div>
    );
}
const LessonForums = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Самообразование: Форумы
                </h1>
                <p className='headshadowtext'>
на 99999 страниц
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Форумы для веб-программистов могут быть очень полезными инструментами для самообучения начинающих веб-программистов. На таких форумах можно найти множество полезной информации, задать свои вопросы и получить ответы от опытных веб-разработчиков.<br/>
<br/>
                Форумы могут помочь начинающим веб-программистам узнать о новых технологиях и методах веб-разработки, а также о лучших практиках и советах. Форумы могут также помочь в обмене опытом с другими веб-разработчиками, что может привести к более эффективной и профессиональной разработке веб-сайтов и приложений.<br/>
<br/>
                На форумах можно найти ответы на многие вопросы, связанные с веб-разработкой, например, как решить определенные проблемы с кодом или как использовать определенный инструмент. Опытные веб-разработчики могут помочь начинающим учиться и наставлять их на правильный путь.<br/>
<br/>
                После общения на форумах начинающие веб-программисты могут получить необходимые знания и навыки, чтобы создавать качественные веб-сайты и приложения. Они могут также получить поддержку от сообщества веб-разработчиков и общаться с людьми, которые имеют такие же интересы и цели.<br/>
            </p>
        </div>
    );
};
const LessonOnlineBooks = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Самообразование: Онлайн-учебники
                </h1>
                <p className='headshadowtext'>
и совсем не скучные
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Онлайн-учебники могут быть отличным инструментом для самообучения начинающих веб-программистов. Они могут помочь студентам узнать основы веб-разработки, от самых простых до более сложных концепций и технологий. Онлайн-учебники предлагают гибкое обучение, которое можно пройти в своем собственном темпе, и они обычно бесплатны.<br/>
<br/>
                Онлайн-учебники могут помочь начинающим веб-программистам узнать о разных технологиях и языках программирования, таких как HTML, CSS, JavaScript, PHP, Python и многих других. Студенты могут также узнать о лучших практиках и советах от опытных веб-разработчиков.<br/>
<br/>
                После окончания онлайн-курса студенты могут получить необходимые знания и навыки, чтобы начать разрабатывать веб-сайты и приложения. Они могут также получить сертификат, который подтверждает их знания и может использоваться при поиске работы в этой сфере.<br/>
<br/>
                Однако, стоит отметить, что онлайн-учебники не являются идеальным способом для обучения веб-разработке. Они не предоставляют возможности для обратной связи и задавания вопросов опытным веб-разработчикам. Кроме того, для достижения большего уровня опыта и навыков, студентам может потребоваться более глубокое погружение в программирование и дополнительные курсы.<br/>
            </p>
        </div>
    );
}
const LessonNeurolinks = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Самообразование: Нейросети
                </h1>
                <p className='headshadowtext'>
которые заменят тебя
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Нейросети могут быть полезным инструментом для самообучения начинающих веб-программистов. Они могут помочь студентам узнать о разных аспектах веб-разработки, от оптимизации сайта до анализа данных и машинного обучения.<br/>
<br/>
                Например, студенты могут использовать нейросети для обучения алгоритмов машинного обучения, которые могут помочь им улучшить производительность своих веб-приложений. Они также могут использовать нейросети для анализа данных, что может помочь им сделать более информированные решения в своих проектах.<br/>
<br/>
                Кроме того, нейросети могут помочь студентам узнать о технологиях, которые могут быть полезны при работе в веб-разработке, например, о том, как улучшить опыт пользователя или о том, как оптимизировать веб-сайты для поисковых систем.<br/>
<br/>
                Однако, стоит отметить, что использование нейросетей для самообучения требует достаточного уровня знаний в области математики и программирования. Для начинающих веб-программистов может потребоваться дополнительное обучение, чтобы овладеть этими навыками.<br/>
<br/>
                После окончания курса по использованию нейросетей для веб-разработки, студенты могут получить новые знания и навыки, которые могут использовать в своих проектах и при поиске работы в этой сфере. Однако, для достижения большего уровня опыта и навыков, студентам может потребоваться дополнительное обучение и практика.<br/>
            </p>
        </div>
    );
};
const LessonBooks = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
Книги, которые помогут
                </h1>
                <p className='headshadowtext'>
и по-настоящему научат :)
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Книги для начинающих веб-программистов предназначены для того, чтобы помочь им овладеть основами веб-разработки, включая языки программирования, фреймворки и инструменты, которые используются для создания и поддержки веб-сайтов.<br/>
<br/>
                Такие книги могут помочь начинающим веб-разработчикам:<br/>
<br/>
                Понять основы веб-технологий, таких как HTML, CSS и JavaScript.<br/>
                Овладеть фреймворками для веб-разработки, такими как React, Angular и Vue.js.<br/>
                Изучить инструменты и технологии, которые используются для создания и поддержки веб-сайтов, такие как Git, Node.js, Webpack и другие.<br/>
                Примеры книг для начинающих веб-разработчиков:<br/>
<br/>
                "HTML and CSS: Design and Build Websites" от Джона Дакетта - эта книга предназначена для тех, кто только начинает изучать веб-разработку. Она объясняет основы HTML и CSS и дает практические советы по их использованию для создания веб-сайтов.<br/>
<br/>
                "JavaScript and JQuery: Interactive Front-End Web Development" от Джон Дакетта - эта книга описывает, как использовать JavaScript и JQuery для создания интерактивных элементов на веб-сайтах. Она также включает в себя примеры кода и упражнения, чтобы помочь читателям научиться применять знания на практике.<br/>
<br/>
                "Learning React: A Hands-On Guide to Building Web Applications Using React and Redux" от Кирка Джексона - эта книга предназначена для тех, кто уже знаком с основами веб-разработки и хочет изучить React, один из наиболее популярных фреймворков для создания веб-приложений. Книга содержит практические упражнения и примеры кода, чтобы помочь читателям овладеть навыками использования React и Redux.<br/>
<br/>
                "Node.js in Action" от Майкла Чадбурна - эта книга объясняет, как использовать Node.js для создания высокопроизводительных веб-приложений. Она включает в себя примеры кода и упражнения, чтобы помочь читателям овладеть навыками создания и развертывания веб-приложений с помощью Node.js.<br/>
            </p>
        </div>
    );
};
const LessonUsefulLinks = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
Полезные ссылки
                </h1>
                <p className='headshadowtext'>
в самый нужный момент
                </p>
            </div>
            <p style={{fontSize:'1.3em'}} className='textareabody'>
                Полезные ссылки для начинающих веб-программистов могут помочь им углубить свои знания в области веб-разработки и научиться использовать новые инструменты и технологии. Такие ссылки обычно содержат обучающие материалы, видеоуроки, документацию и примеры кода, которые помогут начинающим программистам изучить новые языки программирования, фреймворки и инструменты.<br/>
<br/>
                Примеры полезных ссылок для начинающих веб-разработчиков:<br/>
<br/>
                Codecademy (https://www.codecademy.com) - это платформа для онлайн-обучения, которая предоставляет интерактивные уроки по различным языкам программирования, включая HTML, CSS, JavaScript и другие. С помощью Codecademy начинающие веб-разработчики могут изучать новые языки программирования в своем собственном темпе и получать обратную связь от других пользователей.<br/>
<br/>
                Mozilla Developer Network (https://developer.mozilla.org/en-US/) - это ресурс, который содержит документацию и обучающие материалы по различным веб-технологиям, таким как HTML, CSS, JavaScript и другие. На этом сайте начинающие веб-разработчики могут найти полезные советы, руководства и примеры кода, чтобы улучшить свои навыки.<br/>
<br/>
                W3Schools (https://www.w3schools.com) - это ресурс, который содержит обучающие материалы и руководства по различным веб-технологиям, таким как HTML, CSS, JavaScript и другие. На этом сайте начинающие веб-разработчики могут найти множество примеров кода и упражнений, чтобы лучше понимать, как работают эти технологии.<br/>
<br/>
                Stack Overflow (https://stackoverflow.com) - это сообщество разработчиков, которые могут помочь ответить на вопросы, связанные с веб-разработкой. Начинающие веб-разработчики могут задавать свои вопросы и получать ответы от опытных разработчиков.<br/>
<br/>
                GitHub (https://github.com) - это платформа для хранения и совместной работы с исходным кодом. Начинающие веб-разработчики могут использовать GitHub для хранения своего кода, изучения кода других разработчиков и участия в проектах с открытым исходным кодом.<br/>
            </p>
        </div>
    );
}
const LessonLost = () => {
    return (
        <div>
            <div className='headlesson'>
                <h1>
                    Данного урока не существует
                </h1>
                <p className='headshadowtext'>
                    Вы перешли на несуществующий, либо удалённый урок
                </p>
            </div>
            <p style={{fontSize:'1.3em'}}>
                Попробуйте вернуться и выбрать другой урок
            </p>
        </div>
    );
};

export {LessonBeforeAll, LessonRoadmaps, LessonLangChoice, LessonBooks, LessonForums, LessonGeekbrains, LessonLost, LessonNeurolinks, LessonOnlineBooks, LessonOnlineSch, LessonSelfLearn, LessonSkillbox, LessonSkillfactory, LessonTutors, LessonUsefulLinks, LessonYaPractice, LessonYT};